---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.CannotCreateGroupWithInvalidReferences
source: html/7a70aba1-7c70-350a-1b5c-89e231bb8c9f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.CannotCreateGroupWithInvalidReferences Property

The elements you have selected for grouping contain dimensions or tags which do not reference a common model group.
 No detail group has been created.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateGroupWithInvalidReferences { get; }
```